{
  "dishes": [
    {
      "name": "Pad Thai",
      "description": "Fast and easy? Adaptable? Simple? Delicious? That’s this vegetarian pad thai.",
      "image_url": "http://cdn.pinchofyum.com/wp-content/uploads/Vegetarian-Pad-Tha-2-2-600x900.jpg",
      "directions": "Bring a pot of water to boil over high heat. Dunk in rice noodles and stir with a fork to separate. Cook 4-6 minutes, just until noodles are limp but still too firm to eat (a little firmer than al dente). Drain and rinse with cold water. Tip: Noodles should be under-cooked at this stage in order to come out right when they are stir-fried.\nCombine 'pad Thai sauce' ingredients in a cup, stirring well to dissolve sugar and tamarind. Note that this sauce should have a very STRONG-tasting flavor: sour-sweet first, followed by salty and spicy. Add more sugar if too sour.  Set aside.\nWarm a wok or large frying pan over medium-high heat. Add 1-2 Tbsp. oil plus garlic and onion. Stir-fry 1 minute to release the fragrance.\nAdd bok choy plus enough stock or white wine to keep ingredients frying nicely. Stir-fry 2 minutes, or until bok choy is bright green and slightly softened.\nPush ingredients aside and add 1/2 Tbsp. more oil to the center of the wok/pan. Add the egg (if using) and stir-fry briefly to scramble.\nIf pan is dry, push ingredients aside and add a little more oil to the middle. Add the drained noodles and 1/3 of the sauce. Stir-fry everything together 1-2 minutes using 2 utensils and a gently tossing motion (like tossing a salad). Keep heat between medium-high and high, reducing if noodles begin to stick or burn. Keep adding sauce and continue stir-frying 3-6 more minutes, or until all sauce is added and noodles are soft but still chewy and deliciously sticky.\nSwitch off heat and add bean sprouts, green onion, and 3/4 of the nuts. Toss and taste-test, adding more soy sauce for more salt/flavor. If too salty or sweet for your taste, add a good squeeze of lime juice. If too sour, sprinkle over a little more sugar.\nTo serve, scoop noodles onto a serving platter. Sprinkle with remaining ground nuts and fresh coriander. Add wedges of fresh-cut lime on the side to be squeezed over just before eating. Enjoy!.",
      "type": "Thai",
      "ingredients": [],
      "meals": [1, 2],
      "difficulty": 4,
      "time": 30,
      "rate": 9
    },
    {
      "name": "Winter Vegetable Soup",
      "description": "A quick and hearty vegetable soup with carrots, potatoes, leeks, and kale. 100% vegan, 100% satisfying.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2013/02/20130210-hearty-vegetable-soup-vegan-recipe-1-thumb-625xauto-305418.jpg",
      "directions": "1. \nChop reserved re-hydrated mushrooms kept from making Hearty Vegetable Stock into half-inch pieces. Add mushrooms, broth, leeks, carrot, celery, potato, chickpeas, kale, and soy sauce to a large saucepan. Bring to a boil over medium-high heat, reduce to a simmer, and cook, stirring occasionally, until potatoes are completely tender and beginning to fall apart, about 25 minutes. Stir in cornstarch slurry and allow to simmer 2 minutes longer.\n\n2. \nSeason to taste with salt and pepper, stir in lemon juice and parsley, and serve, drizzling extra-virgin olive oil into bowls as you eat.",
      "type": "Soup",
      "ingredients": [],
      "meals": [1, 2],
      "difficulty": 4,
      "time": 30,
      "rate": 5
    },
    {
      "name": "Lentil Soup",
      "description": "A super simple lentil soup with a bright, balanced flavor.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2013/02/20120206-lentil-soup-recipe1-thumb-625xauto-303346.jpg",
      "directions": "1.\nHeat olive oil in a large Dutch oven over medium-high heat until shimmering. Add onions, carrots, and celery, and cook, stirring occasionally, until softened but not browned, about 5 minutes. Add garlic and cook until fragrant, about 30 seconds. Add lentils and stir to combine. Add bay leaf, water (or broth) and a large pinch kosher salt. Bring to a boil, reduce to a bare simmer, cover with lid slightly cracked, and cook until lentils are completely tender and falling apart, about 1 hour total, adding water as necessary (lentils should be completely covered at all times).\n\n2.\nUsing a hand blender, blend soup until as smooth as desired. Alternatively, transfer half of soup to a standing blender, blend until smooth, and fold back into remaining soup. Whisk in vinegar or lemon juice to taste, along with parsley (reserving some parsley for garnish). Season to taste with salt and pepper and serve.",
      "type": "Soup",
      "ingredients": [],
      "meals": [1, 2],
      "difficulty": 6,
      "time": 90,
      "rate": 6
    },
    {
      "name": "Beet and Citrus Salad With Pine Nut Vinaigrette",
      "description": "Sweet as candy, rich and earthy, with a great sorta-soft-sorta-crisp texture, fresh beets are one of my favorite vegetables to work with.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2015/12/20120202-beet-grapefruit-orange-pinenut-salad-kenji-thumb-1500xauto-428368.jpg",
      "directions": "1.\nAdjust oven rack to middle position and preheat oven to 375°F. Fold two 12- by 18-inch squares of heavy duty aluminum foil in half cross-wise. Crimp the left and right edges to form a tight seal (leave the top open). Toss beets with 1 tablespoon olive oil and season with salt and pepper. Divide evenly between both foil pouches. Add 2 sprigs rosemary or thyme to each pouch, then tightly crimp top of pouch to seal.\n\n2.\nPlace pouches on a rimmed baking sheet and place in oven. Cook until beets are completely tender and a cake tester or toothpick inserted into a beet through the foil pouch shows no resistance, about 1 hour. Open pouches and allow beets to cool for 30 minutes. Peel under cold running water (the skin should slip right off). Cut beets into rough 1 1/2-inch chunks.\n\n3.\nCombine vinegar, agave nectar, half of pinenuts, and shallots in a medium bowl. Whisking constantly, slowly drizzle in remaining 4 tablespoons olive oil followed by walnut oil. Season dressing to taste with salt and pepper.\n\n4.\nToss beets with half of dressing in a large bowl, then transfer to a serving plate. Add grapefruit, orange, and arugula leaves to bowl along with 1 more tablespoon dressing. Toss and season to taste with salt and pepper. Transfer to serving plate with beets. Drizzle remaining dressing around beets, sprinkle with remaining pinenuts, top with orange zest, and serve.",
      "type": "Salad",
      "ingredients": [],
      "meals": [1, 2],
      "difficulty": 4,
      "time": 60,
      "rate": 6
    },
    {
      "name": "Creamy Vegan Fingerling Potato Salad",
      "description": "Fingerling potatoes in a sweet-tart vinaigrette made extra-creamy with the addition of potato cooking liquid and mashed yukon golds. Creamy, delicious, and 100% vegan.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2013/02/20130210-vegan-potato-salad-5-thumb-625xauto-305173.jpg",
      "directions": "1.\nPlace potatoes, 1 tablespoon salt, 1 tablespoon vinegar, and 3 cups tepid water in a medium saucepan. Bring to a boil over high heat, stirring occasionally until salt is dissolved. Reduce to a bare simmer and cook until potatoes are completely tender and show no resistance when poked with a paring knife or cake tester, about 17 minutes. Drain potatoes, reserving 1/2 cup of cooking liquid. Immediately toss potato pieces with 1/2 tablespoon vinegar and set aside.\n\n2.\nCombine reaeved cooking liquid with remaining 1 tablespoon vinegar, mustard, relish, sugar, and minced shallot in a large bowl. Add 5 to 6 pieces of cooked Yukon gold potato. Mash with a potato masher until smooth. Whisking constantly, add 3 tablespoons olive oil. Fold in capers, celery, sliced shallot, parsley, and potatoes. Season to taste with salt and more sugar if desired. Serve immediately, drizzling with remaining olive oil or refrigerate for up to three days. Allow to come to room temperature before serving.",
      "type": "Salad",
      "ingredients": [],
      "meals": [1, 2],
      "difficulty": 3,
      "time": 25,
      "rate": 7
    },
    {
      "name": "Marinated Kale and Chickpea Salad With Sumac Onions Recipe",
      "description": "With marinated kale, you don't even have to massage your greens. This salad is good to go straight from the fridge.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2012/01/20120121-kale-chickpeas-onions-2-thumb-625xauto-213545.jpg",
      "directions": "1.\nCombine kale leaves with olive oil and 1 teaspoon salt in a large bowl. Toss until evenly coated. Allow to rest at room temperature until kale is lightly wilted, about 1 hour.\n\n2.\nMeanwhile, place onions in a medium bowl and cover with cold water. Allow to rest for 15 minutes. Rinse in several changes of water then carefully dry with a salad spinner lined with paper towels. Combine onions with sumac and sesame seeds. Season to taste with salt.\n\n3.\nCombine lemon juice, garlic, and mustard in a small bowl. Once kale is wilted, toss kale, lemon juice mixture, and chickpeas in a large bowl. Season to taste with salt and pepper. Serve salad topped with sumac onions.",
      "type": "Salad",
      "ingredients": [],
      "meals": [1, 2],
      "difficulty": 2,
      "time": 15,
      "rate": 9
    },
    {
      "name": "Toast With Refried Beans and Avocado",
      "description": "Tasty, filling, but not overly heavy, this is ideal breakfast fare for those who want something beside the bacon and eggs.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2013/02/20130219-avocado-bean-toast-2-thumb-625xauto-309398.jpg",
      "directions": "1.\nToast bread to desired level of doneness. Top with refried beans and avocado (mash with a fork if desired). Add slivered onions, sprinkle with salt, and serve.",
      "type": "Breakfast",
      "ingredients": [],
      "meals": [0, 2],
      "difficulty": 2,
      "time": 5,
      "rate":10
    },
    {
      "name": "Toasted Oatmeal With Maple Syrup, Cranberries, and Raspberries",
      "description": "Toasted oatmeal with cranberry and raspberry with a drizzle of maple syrup makes a killer breakfast, even for non-vegans.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2012/01/20120115-vegan-experience-day-1-1-thumb-625xauto-211724.jpg",
      "directions": "1.\nHeat oats in a medium saucepan over medium heat, stirring and tossing constantly until pale golden brown and a nutty aroma develops, about 3 minutes. Add water, berries, sugar, and salt. Bring to a boil over high heat then reduce to a bare simmer.\n\n2.\nCook, stirring occasionally until oatmeal is cooked and berries have softened, about 20 minutes total. Gently mash berries with the back of a wooden spoon as they cook to rupture them. Serve immediately, drizzling with maple syrup at the table.",
      "type": "Breakfast",
      "ingredients": [],
      "meals": [0, 2],
      "difficulty": 4,
      "time": 25,
      "rate": 7
    },
    {
      "name": "Chilaquiles With Pepitas, Charred Corn, and Black Beans",
      "description": "Chilaquiles are a classic Mexican breakfast dish that can be pretty aptly described as a fried tortilla casserole. Crisp chips are soaked in salsa (in this case a bright and tangy salsa verde made from tomatillos—charred to add some bitter, smoky depth) until just barely softened but still mildly crunchy. This vegan recipe combines black beans with charred corn, along with a few slices of avocado and a handful of toasted pumpkin seeds for a meal that's not only balanced in carbs, protein, and high in good green vegetables, but is crazy delicious to boot.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2012/01/20110116-chilaquiles-pumpkin-seed-salsa-verde-1-thumb-625xauto-212185.jpg",
      "directions": "1.\nPreheat broiler to high. Place tomatillos, garlic, onion, and pepper on a foil-lined heavy-duty rimmed baking sheet. Broil without moving until well charred on top side, about 15 minutes. Flip vegetables with a spatula and continue broiling until well-charred and completely softened, about 15 minutes longer.\n\n2.\nTransfer vegetables to a food processor and process until roughly pureed. Season salsa verde to taste with kosher salt and set aside.\n\n3.\nHeat oil in a medium skillet over high heat until smoking. Add corn kernels, toss to coat, and cook without moving until charred on one side. Toss and continue to cook, tossing occasionally until well charred all over, about 6 minutes total. Season to taste with kosher salt and transfer to a small bowl.\n\n4.\nHeat 1 1/2 cups salsa verde and 1 cup water in a large saucepan until simmering. Add tortilla chips and fold with a rubber spatula until all the chips are coated. Transfer chips to a large serving dish or individual serving plates. Top with charred corn, black beans, avocado slices, sliced onion, chopped cilantro, and toasted pumpkin seeds. Serve immediately with a side of vegan refried beans if desired.",
      "type": "Breakfast",
      "ingredients": [],
      "meals": [0, 2],
      "difficulty": 7,
      "time": 50,
      "rate": 8
    },
    {
      "name": "Crispy Potato, Onion, and Mushroom Rösti",
      "description": "This brunch dish is crispy and golden brown on the outside, creamy and tender in the middle, flavored with sautéed onions and mushrooms.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2012/01/20120129-rosti-1-thumb-625xauto-215095.jpg",
      "directions": "1.\nSpread potatoes on a large microwave-safe plate and microwave on high heat until hot all the way through and softened but still slightly crunchy, about 5 minutes.\n\n2.\nMeanwhile, heat 1 tablespoon oil in a 10-inch well seasoned cast iron or nonstick skillet over medium-high heat until shimmering. Add onions and mushrooms and cook, stirring and tossing occasionally, until softened and starting to brown, about 8 minutes. Add garlic and thyme and cook, stirring frequently, until fragrant, about 30 seconds. Season to taste with salt and pepper. Transfer to a small bowl and wipe out skillet.\n\n3.\nHeat 2 tablespoons oil in skillet over medum heat until shimmering. Add half of potatoes and press into bottom of the pan with a rubber spatula. Season with salt and pepper. Spread onion/mushroom mixture evenly over the potatoes and top with remaining potatoes. Press down into an even disk shape using a rubber spatula. Season top with salt and pepper.\n\n4.\nCook, swirling and shaking pan occasionally until deep golden brown and crisp on the first side, about 7 minutes. Carefully slide rösti to a large plate. Set another plate on top of it upside down, grip the edges, and invert the whole thing so the rösti is now cooked-side-up. Heat remaining two tablespoons oil in the skillet and slide rösti back in. Continue cooking, swirling and shaking pan occasionally until deep golden brown and crisp on the second side, about 7 minutes longer. Slide rösti to a cutting board. Serve immediately with a side of vegan aïoli.",
      "type": "Breakfast",
      "ingredients": [],
      "meals": [0, 2],
      "difficulty": 5,
      "time": 30,
      "rate": 7
    },
    {
      "name": "Mapo Tofu",
      "description": "This is my favorite dish of all time, in a completely meat-free form. Using dried and fresh mushrooms adds complexity and texture to the fiery dish, making it every bit as good as—if not better than—the original.",
      "image_url": "http://www.seriouseats.com/recipes/assets_c/2013/02/20120206-vegan-mapo-tofu-12-thumb-625xauto-304261.jpg",
      "directions": "1.\nCombine dried mushrooms and kombu (if using) in a small bowl or liquid measuring cup and cover with water. Place a paper towel or kitchen towel directly on surface of water to keep mushrooms mostly submerged. Set aside for ten minutes to rehydrate.\n\n2.\nMeanwhile, place button mushrooms in the bowl of a food processor and pulse until chopped into rough 1/4-inch pieces, about 6 to 8 one-second pulses. Combine chopped button mushrooms and oil in the bottom of a large wok. Heat over high heat, stirring constantly, until mushrooms are shriveled and well browned, 6 to 10 minutes. Strain through a fine mesh strainer set over a small saucepan. Transfer fried mushrooms to a medium bowl and return oil to wok.\n\n3.\nWhen dried mushrooms are rehydrated, strain through a fine mesh strainer set over a small bowl. Discard kombu. Discard all but 3/4 cups soaking liquid. Add cornstarch, wine, and soy sauce to liquid. Transfer drained mushrooms to a cutting board. Remove and discard hard central stems from woodear mushrooms, then finely chope all the mushrooms. Add to bowl with fried mushrooms.\n\n4.\nAdd whole Sichuan peppercorns and both chilis to oil in wok and return to high heat. Cook until fragrant and peppercorns have stopped sputtering. Do not overcook, or they will burn. Immediately strain through a fine mesh strainer, discard peppercorns and chilies, and return oil to wok.\n\n5.\nHeat oil over high heat until lightly smoking. Add garlic, ginger, scallion whites, chives, and yacai (if using). Stir-fry until fragrant, about 30 seconds. Add chopped mushrooms and stir-fry to combine. Add fermented chili broad bean paste and stir until all the vegetables are well coated. Stir mushroom liquid mixture to incorporate cornstarch, then add to wok. Cook, storring constantly, until lightly thickened and reduced, about 1 1/2 minutes. Add tofu and carefully fold in, trying not to break it.\n\n6.\nCook until tofu is heated through. Transfer to a serving platter, drizzle with chili oil, and top with scallions and ground Sichuan peppercorns. Serve immediately with white rice.",
      "type": "Mains",
      "ingredients": [],
      "meals": [1, 2],
      "difficulty": 6,
      "time": 30,
      "rate": 9
    }
  ]
}